<a href="https://colab.research.google.com/github/bignamu/python-AI/blob/main/Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#Pandas

## 자료구조 : Seires와 Dataframe



Pandas에서 제공하는 데이터 자료구조는 Series와 Dataframe 두가지가 존재하는데 Series는 시계열과 유사한 데이터로서 index와 value가 존재하고 Dataframe은 딕셔너리데이터를 매트릭스 형태로 만들어 준 것 같은 frame을 가지고 있다. 이런 데이터 구조를 통해 시계열, 비시계열 데이터를 통합하여 다룰 수 있다.

#Series

In [ ]:
from pandas import Series,DataFrame
import pandas as pd

In [ ]:
fruit = Series([2500,3800,1200,6000],
               index = ['apple','banana','pear','cherry'])

In [ ]:
fruit

apple     2500
banana    3800
pear      1200
cherry    6000
dtype: int64

In [ ]:
fruit.index

Index(['apple', 'banana', 'pear', 'cherry'], dtype='object')

In [ ]:
fruit.values

array([2500, 3800, 1200, 6000])

In [ ]:
fruit.index

Index(['apple', 'banana', 'pear', 'cherry'], dtype='object')

Series의 형태는 딕셔너리하고 매우 유사하나 key가 index로 바뀐 정도가 아니라 데이터 구조 자체가 매우 다르다

In [ ]:
fruitData = {'apple':2500,
             'banana':3800,
             'pear':1200,
             'cherry':6000}

In [ ]:
fruit = Series(fruitData)

In [ ]:
print(type(fruitData),type(fruit))

<class 'dict'> <class 'pandas.core.series.Series'>

In [ ]:
fruit.name='fruitPrice'

In [ ]:
fruit

apple     2500
banana    3800
pear      1200
cherry    6000
Name: fruitPrice, dtype: int64

In [ ]:
fruit.index.name = 'fruitName'

In [ ]:
fruit

fruitName
apple     2500
banana    3800
pear      1200
cherry    6000
Name: fruitPrice, dtype: int64

In [ ]:
fruitData = {'fruitName':['apple','banana','cherry','pear'],
             'fruitPrice':[2500,3800,6000,1200],
             'num':[10,5,3,8]}

In [ ]:
type(fruitData)

dict

In [ ]:
fruitFrame = DataFrame(fruitData)

In [ ]:
type(fruitFrame)

pandas.core.frame.DataFrame

In [ ]:
fruitFrame

  fruitName  fruitPrice  num
0     apple        2500   10
1    banana        3800    5
2    cherry        6000    3
3      pear        1200    8

In [ ]:
fruitFrame = DataFrame(fruitData,columns=['fruitPrice','num','fruitName'])

In [ ]:
fruitFrame

   fruitPrice  num fruitName
0        2500   10     apple
1        3800    5    banana
2        6000    3    cherry
3        1200    8      pear

In [ ]:
fruitFrame['fruitName']

0     apple
1    banana
2    cherry
3      pear
Name: fruitName, dtype: object

In [ ]:
fruitFrame.fruitName

0     apple
1    banana
2    cherry
3      pear
Name: fruitName, dtype: object

In [ ]:
type(fruitFrame.fruitName)

pandas.core.series.Series

In [ ]:
fruitFrame['Year'] = 2021

In [ ]:
fruitFrame

   fruitPrice  num fruitName  Year
0        2500   10     apple  2021
1        3800    5    banana  2021
2        6000    3    cherry  2021
3        1200    8      pear  2021

In [ ]:
var = Series([4,2,1], index = [0,2,3])

In [ ]:
fruitFrame['stock'] = var

In [ ]:
fruitFrame

   fruitPrice  num fruitName  Year  stock
0        2500   10     apple  2021    4.0
1        3800    5    banana  2021    NaN
2        6000    3    cherry  2021    2.0
3        1200    8      pear  2021    1.0

In [ ]:
fruit = Series([2500,3800,1200,6000],index=['apple','banana','pear','cherry'])

In [ ]:
fruit

apple     2500
banana    3800
pear      1200
cherry    6000
dtype: int64

In [ ]:
new_fruit = fruit.drop('banana')

In [ ]:
new_fruit

apple     2500
pear      1200
cherry    6000
dtype: int64

In [ ]:
fruitData

{'fruitName': ['apple', 'banana', 'cherry', 'pear'],
 'fruitPrice': [2500, 3800, 6000, 1200],
 'num': [10, 5, 3, 8]}

In [ ]:
fruitName = fruitData['fruitName']

In [ ]:
fruitFrame = DataFrame(fruitData,
                       index=fruitName,
                       columns = ['fruitPrice','num'])

In [ ]:
fruitFrame

        fruitPrice  num
apple         2500   10
banana        3800    5
cherry        6000    3
pear          1200    8

In [ ]:
fruitFrame2 = fruitFrame.drop(['apple','cherry'])

In [ ]:
fruitFrame2

        fruitPrice  num
banana        3800    5
pear          1200    8

In [ ]:
fruitFrame3 = fruitFrame.drop('num',axis=1)

In [ ]:
fruitFrame

        fruitPrice  num
apple         2500   10
banana        3800    5
cherry        6000    3
pear          1200    8

In [ ]:
fruitFrame3

        fruitPrice
apple         2500
banana        3800
cherry        6000
pear          1200

#Slice

In [ ]:
fruit

apple     2500
banana    3800
pear      1200
cherry    6000
dtype: int64

In [ ]:
fruit['apple':'pear']

apple     2500
banana    3800
pear      1200
dtype: int64

In [ ]:
fruitData

{'fruitName': ['apple', 'banana', 'cherry', 'pear'],
 'fruitPrice': [2500, 3800, 6000, 1200],
 'num': [10, 5, 3, 8]}

In [ ]:
fruitName = fruitData['fruitName']

In [ ]:
fruitFrame = DataFrame(fruitData,index=fruitName,columns=['fruitPrice','num'])

In [ ]:
fruitFrame['fruitPrice']

apple     2500
banana    3800
cherry    6000
pear      1200
Name: fruitPrice, dtype: int64

In [ ]:
fruitFrame['apple':'banana']

        fruitPrice  num
apple         2500   10
banana        3800    5

##데이터의 기본연산

In [ ]:
fruit1 = Series([5,9,10,3],index=['apple','banana','cherry','pear'])

In [ ]:
fruit2 = Series([3,2,9,5,10],index=['apple','orange','banana','cherry','mango'])

In [ ]:
print(fruit1,fruit2)

apple      5
banana     9
cherry    10
pear       3
dtype: int64 apple      3
orange     2
banana     9
cherry     5
mango     10
dtype: int64

In [ ]:
fruit1 + fruit2

apple      8.0
banana    18.0
cherry    15.0
mango      NaN
orange     NaN
pear       NaN
dtype: float64

In [ ]:
fruitData1 = {'Ohio':[4,8,3,5],'Texas':[0,1,2,3]}
fruitFrame1 = DataFrame(fruitData1,columns=['Ohio','Texas'],
                        index = ['apple','banana','cherry','pear'])

In [ ]:
fruitData2 = {'Ohio':(3,0,2,1,7),'Colorado':[5,4,3,6,0]}
fruitFrame2 = DataFrame(fruitData2,columns=['Ohio','Colorado'],
                        index = ['apple','orange','banana','cherry','mango'])

In [ ]:
print(fruitFrame1)

        Ohio  Texas
apple      4      0
banana     8      1
cherry     3      2
pear       5      3

In [ ]:
print(fruitFrame2)

        Ohio  Colorado
apple      3         5
orange     0         4
banana     2         3
cherry     1         6
mango      7         0

In [ ]:
fruitFrame1 + fruitFrame2

        Colorado  Ohio  Texas
apple        NaN   7.0    NaN
banana       NaN  10.0    NaN
cherry       NaN   4.0    NaN
mango        NaN   NaN    NaN
orange       NaN   NaN    NaN
pear         NaN   NaN    NaN

## 데이터의 정렬

In [ ]:
fruit = Series([2500,3800,1200,6000],
               index = ['apple','banana','pear','cherry'])

In [ ]:
fruit

apple     2500
banana    3800
pear      1200
cherry    6000
dtype: int64

In [ ]:
fruit.sort_values(ascending=False)

cherry    6000
banana    3800
apple     2500
pear      1200
dtype: int64

In [ ]:
fruitData = {'fruitName':['pear','banana','apple','cherry'],
'fruitPrice':[2500,3800,6000,1200],
'num':[10,5,3,8]}

In [ ]:
fruitName = fruitData['fruitName']

In [ ]:
fruitFrame = DataFrame(fruitData,index=fruitName,columns=['num','fruitPrice'])

In [ ]:
fruitFrame

        num  fruitPrice
pear     10        2500
banana    5        3800
apple     3        6000
cherry    8        1200

In [ ]:
fruitFrame.sort_index()

        num  fruitPrice
apple     3        6000
banana    5        3800
cherry    8        1200
pear     10        2500

In [ ]:
fruitFrame.sort_index(axis=1)

        fruitPrice  num
pear          2500   10
banana        3800    5
apple         6000    3
cherry        1200    8

In [ ]:
fruitFrame.sort_values(by=['fruitPrice','num'],ascending=False)
#2개 비교가능

        num  fruitPrice
apple     3        6000
banana    5        3800
pear     10        2500
cherry    8        1200

## 기초분석



Pandas는 데이터를 구조적인 측면에서 좀 더 편하게 다룰 수 있게 하는 장점을 모아서 만든 패키지로 Pandas에서 제공하는 통계 분석은 기술 통계 및 데이터 요약이다. 고급 통계 기법은 scikit-learn이나 다른 통계 패키지를 이용하여 수행 할 수 있다.

![기술통계량](https://github.com/KoreaEva/AI/blob/master/HOL/04.Numpy,%20Pandas,%20Matplotlib/images/numpy-5.png?raw=true)

In [ ]:
german = pd.read_csv('http://freakonometrics.free.fr/german_credit.csv')

In [ ]:
list(german.columns.values)

['Creditability',
 'Account Balance',
 'Duration of Credit (month)',
 'Payment Status of Previous Credit',
 'Purpose',
 'Credit Amount',
 'Value Savings/Stocks',
 'Length of current employment',
 'Instalment per cent',
 'Sex & Marital Status',
 'Guarantors',
 'Duration in Current address',
 'Most valuable available asset',
 'Age (years)',
 'Concurrent Credits',
 'Type of apartment',
 'No of Credits at this Bank',
 'Occupation',
 'No of dependents',
 'Telephone',
 'Foreign Worker']

In [ ]:
german_sample=german[['Creditability',
                      'Duration of Credit (month)',
                      'Purpose',
                      'Credit Amount']]

In [ ]:
german_sample.min()

Creditability                   0
Duration of Credit (month)      4
Purpose                         0
Credit Amount                 250
dtype: int64

In [ ]:
german_sample.max()

Creditability                     1
Duration of Credit (month)       72
Purpose                          10
Credit Amount                 18424
dtype: int64

In [ ]:
german_sample.mean()

Creditability                    0.700
Duration of Credit (month)      20.903
Purpose                          2.828
Credit Amount                 3271.248
dtype: float64

In [ ]:
german_sample.median()

Creditability                    1.0
Duration of Credit (month)      18.0
Purpose                          2.0
Credit Amount                 2319.5
dtype: float64

In [ ]:
german_sample.describe()

       Creditability  Duration of Credit (month)      Purpose  Credit Amount
count    1000.000000                 1000.000000  1000.000000     1000.00000
mean        0.700000                   20.903000     2.828000     3271.24800
std         0.458487                   12.058814     2.744439     2822.75176
min         0.000000                    4.000000     0.000000      250.00000
25%         0.000000                   12.000000     1.000000     1365.50000
50%         1.000000                   18.000000     2.000000     2319.50000
75%         1.000000                   24.000000     3.000000     3972.25000
max         1.000000                   72.000000    10.000000    18424.00000

## 상관관계와 공분산



공분산(Covariance) : X의 편차와 Y의 편차를 곱한 것의 평균, X와 Y의 단위에 영향을 받는다.



상관계수(Correlation) : 확률변수의 절대적 크기에 영향을 받지 않도록 단위화, 분산의 크기만큼 나눔

In [ ]:
german_sample=german[['Duration of Credit (month)','Credit Amount','Age (years)']]

In [ ]:
german_sample.head()

   Duration of Credit (month)  Credit Amount  Age (years)
0                          18           1049           21
1                           9           2799           36
2                          12            841           23
3                          12           2122           39
4                          12           2171           38

In [ ]:
#상관계수
german_sample.corr()

                            Duration of Credit (month)  ...  Age (years)
Duration of Credit (month)                    1.000000  ...    -0.037550
Credit Amount                                 0.624988  ...     0.032273
Age (years)                                  -0.037550  ...     1.000000

[3 rows x 3 columns]

In [ ]:
#공분산
german_sample.cov()

                            Duration of Credit (month)  ...  Age (years)
Duration of Credit (month)                  145.415006  ...    -5.140567
Credit Amount                             21274.007063  ...  1034.202787
Age (years)                                  -5.140567  ...   128.883119

[3 rows x 3 columns]